TP-Base/src/main/resources/wsdl/sample-req.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<ns2:addReservation xmlns:ns2="http://tool.autobahn.geant.net/">
			<resID>res1</resID>
			<ipath>
				<links>
					<startInterface>
						<node>
							<name>Node1.1</name>
							<ipAddress>Node1.1</ipAddress>
							<vlanTranslationSupport>true</vlanTranslationSupport>
						</node>
						<name>p1.1</name>
						<description></description>
						<bandwidth>1000000000</bandwidth>
						<mtu>0</mtu>
						<domainId>http://localhost:8080/autobahn/interdomain</domainId>
						<clientPort>false</clientPort>
					</startInterface>
					<endInterface>
						<node>
							<name>cli-node1</name>
							<ipAddress>cli-node1</ipAddress>
							<vlanTranslationSupport>false</vlanTranslationSupport>
						</node>
						<name>cli-port1</name>
						<description></description>
						<bandwidth>10000000000</bandwidth>
						<mtu>0</mtu>
						<domainId>http://client-domain.domain1.com</domainId>
						<clientPort>false</clientPort>
					</endInterface>
				</links>
				<links>
					<startInterface>
						<node>
							<name>Node1.1</name>
							<ipAddress>Node1.1</ipAddress>
							<vlanTranslationSupport>true</vlanTranslationSupport>
						</node>
						<name>p1.3</name>
						<bandwidth>10000000000</bandwidth>
						<mtu>0</mtu>
						<clientPort>false</clientPort>
					</startInterface>
					<endInterface>
						<node>
							<name>Node1.2</name>
							<ipAddress>Node1.2</ipAddress>
							<vlanTranslationSupport>false</vlanTranslationSupport>
						</node>
						<name>p1.5</name>
						<bandwidth>10000000000</bandwidth>
						<mtu>0</mtu>
						<clientPort>false</clientPort>
					</endInterface>
				</links>
				<links>
					<startInterface>
						<node>
							<name>Node1.2</name>
							<ipAddress>Node1.2</ipAddress>
							<vlanTranslationSupport>false</vlanTranslationSupport>
						</node>
						<name>p1.6</name>
						<bandwidth>10000000000</bandwidth>
						<mtu>0</mtu>
						<clientPort>false</clientPort>
					</startInterface>
					<endInterface>
						<node>
							<name>Node1.3</name>
							<ipAddress>Node1.3</ipAddress>
							<vlanTranslationSupport>true</vlanTranslationSupport>
						</node>
						<name>p1.8</name>
						<bandwidth>10000000000</bandwidth>
						<mtu>0</mtu>
						<clientPort>false</clientPort>
					</endInterface>
				</links>
				<links>
					<startInterface>
						<node>
							<name>Node1.3</name>
							<ipAddress>Node1.3</ipAddress>
							<vlanTranslationSupport>true</vlanTranslationSupport>
						</node>
						<name>p1.2</name>
						<description></description>
						<bandwidth>1000000000</bandwidth>
						<mtu>0</mtu>
						<domainId>http://localhost:8080/autobahn/interdomain</domainId>
						<clientPort>false</clientPort>
					</startInterface>
					<endInterface>
						<node>
							<name>cli-node2</name>
							<ipAddress>cli-node2</ipAddress>
							<vlanTranslationSupport>false</vlanTranslationSupport>
						</node>
						<name>cli-port2</name>
						<description></description>
						<bandwidth>10000000000</bandwidth>
						<mtu>0</mtu>
						<domainId>http://client-domain.domain2.com</domainId>
						<clientPort>false</clientPort>
					</endInterface>
				</links>
				<constraints>
					<constraints>
						<name>VLANS</name>
						<value>15</value>
					</constraints>
					<constraints>
						<name>SUPPORTS_VLAN_TRANSLATION</name>
						<value>true</value>
					</constraints>
				</constraints>
				<constraints>
					<constraints>
						<name>VLANS</name>
						<value>15</value>
					</constraints>
					<constraints>
						<name>SUPPORTS_VLAN_TRANSLATION</name>
						<value>true</value>
					</constraints>
				</constraints>
				<constraints>
					<constraints>
						<name>VLANS</name>
						<value>15</value>
					</constraints>
					<constraints>
						<name>SUPPORTS_VLAN_TRANSLATION</name>
						<value>true</value>
					</constraints>
				</constraints>
				<constraints>
					<constraints>
						<name>VLANS</name>
						<value>60</value>
					</constraints>
					<constraints>
						<name>SUPPORTS_VLAN_TRANSLATION</name>
						<value>true</value>
					</constraints>
				</constraints>
			</ipath>
			<params>
				<capacity>1000000</capacity>
				<maxDelay>0</maxDelay>
				<bidirectional>false</bidirectional>
				<startTime>2011-02-17T17:14:42.092+01:00</startTime>
				<endTime>2011-02-17T17:15:12.092+01:00</endTime>
			</params>
		</ns2:addReservation>
	</soap:Body>
</soap:Envelope>